In [1]:
import pandas as pd
import numpy as np

In [2]:
# 任务1: 将列表转化为Numpy数组
data0 = [2, 4, 6.5, 8]
arr0 = np.array(data0)

In [3]:
# 任务2: 新建Pandas中的Series数据类型，打印出其大小、索引值、值

In [4]:
# pandas中的Series数据类型
s = pd.Series(data=[100, 'a', {'dic1':5}],
              index=pd.Index(['id1',20, 'third'], name='my_idx'),
              dtype='object',
              name='my_name')
#（）前面有名称的是函数，括号里的是参数

#位置参数和关键参数

In [5]:
#单个变量Series,多个变量DataFrame

In [6]:
s2 = pd.Series(["1","2","3","4"])

In [7]:
s2.index.values
#.后的是属性，

array([0, 1, 2, 3], dtype=int64)

In [8]:
type(s.values[0])

int

In [9]:
s.size

3

In [10]:
s.shape

(3,)

In [11]:
# 任务3: 创建DataFrame类型的数据，并获取其索引、值及表大小
d = {
    "one": pd.Series([1.0, 2.0, 3.0],index=["a","b","c"]),
    "two":pd.Series([1.0, 2.0, 3.0],index=["a","b","c"]),
    }
df = pd.DataFrame(d)

In [12]:
#"one"是字符串
#{"one": pd.Series([1.0, 2.0, 3.0],index=["a","b","c"]),
#"two":pd.Series([1.0, 2.0, 3.0],index=["a","b","c"]),}是字典
#"one"是key,pd.Series([1.0, 2.0, 3.0],index=["a","b","c"]),是value
#d = {"one": pd.Series([1.0, 2.0, 3.0],index=["a","b","c"]),"two":pd.Series([1.0, 2.0, 3.0],index=["a","b","c"]),}是赋值表达式
#df = pd.DataFrame(d)函数返回值的容器

In [13]:
d1 = {
    "作者": pd.Series(['余华','残雪' ,'莫言']),
    "作品": pd.Series(['活着','暗夜','红高粱']),
    "价格": pd.Series([35,72,38]),                                        
}
df2 = pd.DataFrame(d1)

In [14]:
#"作者"字符串，pd.Series(['余华','残雪' ,'莫言'])函数返回值，系列
#df2 = pd.DataFrame(d1)赋值表达式，

In [15]:
df2.index.values

array([0, 1, 2], dtype=int64)

In [16]:
df2.shape

(3, 3)

In [17]:
df2.size

9

In [18]:
df2['作品']
#将列的名字传进去，将会得到表格中的这一列，是列索引，按列查询数据

0     活着
1     暗夜
2    红高粱
Name: 作品, dtype: object

In [19]:
df2[['作者','价格']]

   作者  价格
0  余华  35
1  残雪  72
2  莫言  38

In [20]:
df2.values
#直接获得它的值

array([['余华', '活着', 35],
       ['残雪', '暗夜', 72],
       ['莫言', '红高粱', 38]], dtype=object)

In [21]:
贵州茅台原始数据 = pd.read_csv(R'output\600519.csv')

In [22]:
#按列查询数据
贵州茅台原始数据['TURNOVER']

0        1410347008
1         463463008
2         194689000
3         177558000
4          86231000
           ...
4089     2694714080
4090    10663392512
4091     5239853056
4092     5581027328
4093     5227695104
Name: TURNOVER, Length: 4094, dtype: int64

In [23]:
贵州茅台原始数据[['TURNOVER','volume']]

         TURNOVER  volume
0      1410347008  406318
1       463463008  129647
2       194689000   53252
3       177558000   48013
4        86231000   23231
...           ...     ...
4089   2694714080   49076
4090  10663392512  204397
4091   5239853056   96885
4092   5581027328   98107
4093   5227695104   89157

[4094 rows x 2 columns]

In [24]:
#按照行索引
贵州茅台原始数据.loc[0]

day           2001-08-27
STOCK_CODE       6005191
open               34.51
close              35.55
maximum            37.78
minimum            32.85
volume            406318
TURNOVER      1410347008
Name: 0, dtype: object

In [25]:
贵州茅台 = 贵州茅台原始数据.set_index('day')

In [26]:
#loc索引器
#单个元素
贵州茅台.loc['2001-08-27']

STOCK_CODE    6.005191e+06
open          3.451000e+01
close         3.555000e+01
maximum       3.778000e+01
minimum       3.285000e+01
volume        4.063180e+05
TURNOVER      1.410347e+09
Name: 2001-08-27, dtype: float64

In [27]:
贵州茅台.loc['2001-08-27','close']

35.55

In [28]:
贵州茅台.loc['2001-08-27', ['open', 'close']]

open     34.51
close    35.55
Name: 2001-08-27, dtype: float64

In [29]:
贵州茅台.loc['2001-10-08', ['open', 'close']]

open     37.00
close    36.58
Name: 2001-10-08, dtype: float64

In [30]:
贵州茅台.loc['2001-08-27':'2001-10-08','open']
#单引号引起来的是字符串

day
2001-08-27    34.51
2001-08-28    34.99
2001-08-29    36.98
2001-08-30    36.28
2001-08-31    37.15
2001-09-03    37.20
2001-09-04    37.01
2001-09-05    37.61
2001-09-06    37.35
2001-09-07    36.50
2001-09-10    35.40
2001-09-11    36.80
2001-09-12    35.33
2001-09-13    36.01
2001-09-14    36.01
2001-09-17    36.08
2001-09-18    35.88
2001-09-19    36.30
2001-09-20    36.90
2001-09-21    36.28
2001-09-24    36.06
2001-09-25    36.28
2001-09-26    36.11
2001-09-27    36.08
2001-09-28    36.90
2001-10-08    37.00
Name: open, dtype: float64

In [32]:
条件1 = 贵州茅台['open'] < 35
条件2 = 贵州茅台['close'] < 35
布尔列表 = 条件1 & 条件2
贵州茅台.loc[布尔列表]
#loc中能放5类值，行或列名字，切片，函数，布尔

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [33]:
#使用函数作为索引
def condition(pd):
    条件1 = pd['open'] < 35
    条件2 = pd['close'] < 35
    布尔列表 = 条件1 & 条件2
    return 布尔列表

In [ ]:
贵州茅台.loc[condition]

In [36]:
贵州茅台.query('open<35 and close<35').open

day
2001-10-17    34.79
2001-10-18    34.20
2001-10-19    34.00
2001-10-22    33.30
2001-11-08    33.35
              ...
2004-09-21    32.09
2004-09-22    32.03
2004-09-23    32.11
2004-09-24    33.60
2004-09-27    34.95
Name: open, Length: 498, dtype: float64

In [39]:
贵州茅台.query('open<35 and close<35')[['open','close']]

             open  close
day
2001-10-17  34.79  34.20
2001-10-18  34.20  34.04
2001-10-19  34.00  33.50
2001-10-22  33.30  32.79
2001-11-08  33.35  33.70
...           ...    ...
2004-09-21  32.09  32.30
2004-09-22  32.03  32.16
2004-09-23  32.11  33.42
2004-09-24  33.60  34.49
2004-09-27  34.95  34.93

[498 rows x 2 columns]

In [49]:
贵州茅台.sample()

            STOCK_CODE   open  close  maximum  minimum  volume  TURNOVER
day
2005-07-06     6005191  51.75  50.31     52.0     50.0    6317  32226601

In [42]:
贵州茅台.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4094 entries, 2001-08-27 to 2018-11-02
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   STOCK_CODE  4094 non-null   int64
 1   open        4094 non-null   float64
 2   close       4094 non-null   float64
 3   maximum     4094 non-null   float64
 4   minimum     4094 non-null   float64
 5   volume      4094 non-null   int64
 6   TURNOVER    4094 non-null   int64
dtypes: float64(4), int64(3)
memory usage: 384.9+ KB

In [47]:
贵州茅台['open'].describe()

count    4094.000000
mean      182.161910
std       165.857882
min        20.900000
25%        47.405000
50%       159.930000
75%       208.500000
max       800.000000
Name: open, dtype: float64

In [51]:
result = 贵州茅台['open'].unique()

In [52]:
result2 = 贵州茅台['open'].nunique()

In [53]:
result3 = 贵州茅台['open'].value_counts()

In [54]:
df = pd.DataFrame({
    "name":["A","B","C","B","c","A","C"],
    "value":[1,3,7,2,4,3,1]
})
df.groupby("name")["value"].sum()

name
A    4
B    5
C    8
c    4
Name: value, dtype: int64